[
    {
        "id": 101,
        "title": "LocaGroca (Food)",
        "category": "iOS Development",
        "image": "https://placehold.co/600x400/FF6B6B/FFFFFF?text=LocaGroca",
        "year": "2024",
        "role": "Mobile Engineer",
        "description": "Addressed the anti-pattern of 'Massive View Controllers' which often renders iOS codebases untestable. I implemented the MVVM (Model-View-ViewModel) architecture to strictly decouple UI rendering from business logic. This approach was chosen to enforce the Single Responsibility Principle (SOLID), ensuring that view logic remains lightweight and ensuring the business rules are unit-testable in isolation.",
        "outcome": "A testable, modular iOS architecture with clear separation of concerns.",
        "techStack": [
            "Swift",
            "SwiftUI",
            "MVVM",
            "CoreData"
        ],
        "metrics": {
            "price": "Private",
            "quality": "SOLID Principles",
            "time": "Active"
        }
    },
    {
        "id": 102,
        "title": "Grocery System",
        "category": "Full-Stack Mobile",
        "image": "https://placehold.co/600x400/4ECDC4/FFFFFF?text=Grocery+App",
        "year": "2024",
        "role": "Full Stack Engineer",
        "description": "Solved the 'it works on my machine' dilemma caused by inconsistent environments between development and production. I architected the backend as stateless services compliant with 12-Factor App principles, specifically focusing on Dev/Prod parity and backing services. This ensures that the API behaves identically across all stages, eliminating environment-specific bugs during mobile integration.",
        "outcome": "Reliable, stateless backend services ensuring consistent mobile integration.",
        "techStack": [
            "Swift",
            "REST API",
            "12-Factor App",
            "CI/CD"
        ],
        "metrics": {
            "price": "Private",
            "quality": "12-Factor Compliant",
            "time": "Active"
        }
    },
    {
        "id": 15,
        "title": "Home Services (MVC)",
        "category": "Software Architecture",
        "image": "/assets/projects/project-15.jpg",
        "year": "2024",
        "role": "Backend Architect",
        "description": "Tackled the issue of 'Spaghetti Code' where business logic is interspersed with HTML, making maintenance a nightmare. I engineered a custom MVC framework to strictly enforce Separation of Concerns (SoC). This architectural choice ensures that data access (Model), user interface (View), and application logic (Controller) change independently, adhering to the Open/Closed Principle for future extensions.",
        "outcome": "A modular framework allowing independent scaling of logic and presentation.",
        "techStack": [
            "PHP",
            "MySQL",
            "MVC Pattern",
            "OOP"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Clean Architecture",
            "time": "Active"
        }
    },
    {
        "id": 10,
        "title": "LibraCore (Library)",
        "category": "Web Development",
        "image": "/assets/projects/project-10.jpg",
        "year": "2024",
        "role": "Frontend Specialist",
        "description": "Mitigated the risk of 'Fragile Base Class' problems and unpredictable UI side effects in complex layouts. I utilized React's component-based architecture with TypeScript to enforce Encapsulation and Type Safety. This decision ensures that each UI component manages its own state and dependencies, preventing leaky abstractions and making the system resilient to refactoring.",
        "outcome": "A resilient, type-safe component library with predictable rendering.",
        "techStack": [
            "TypeScript",
            "React",
            "OOD",
            "Node.js"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Encapsulated",
            "time": "Active"
        }
    },
    {
        "id": 11,
        "title": "Futuristic Banking",
        "category": "FinTech Engineering",
        "image": "/assets/projects/project-11.jpg",
        "year": "2024",
        "role": "Frontend Architect",
        "description": "Addressed the problem of race conditions and unpredictable state mutations common in asynchronous financial transactions. I implemented a Unidirectional Data Flow pattern (Redux-style) to manage application state. This was chosen to maintain 'Single Source of Truth', ensuring that all UI updates are deterministic and easier to debug, which is critical for financial data integrity.",
        "outcome": "Deterministic state management ensuring high-integrity transaction flows.",
        "techStack": [
            "TypeScript",
            "React",
            "Immutable State",
            "3D"
        ],
        "metrics": {
            "price": "Private",
            "quality": "Deterministic",
            "time": "Active"
        }
    },
    {
        "id": 103,
        "title": "Resume / Portfolio",
        "category": "DevOps & Web",
        "image": "https://placehold.co/600x400/333333/FFFFFF?text=Portfolio",
        "year": "2024",
        "role": "Software Engineer",
        "description": "Overcame the inefficiency of requiring code deployments for simple content updates. I applied the 12-Factor principle of 'Externalized Configuration' by separating content (data) from the codebase. This allows the portfolio's content to be updated dynamically without triggering a full rebuild of the application logic, treating content as a backing service.",
        "outcome": "A meaningful separation of code and content, enabling rapid updates.",
        "techStack": [
            "JavaScript",
            "JSON",
            "12-Factor Config",
            "React"
        ],
        "metrics": {
            "price": "Public",
            "quality": "Config Driven",
            "time": "Active"
        }
    }
]